## <font color=purple>Describing the data with pandas<br><font size=3><font color=black>Pandas - Pandas is a software library written for the Python programming language for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables and time series.

### Importing Library

In [1]:
import pandas as pd

### Importing Dataset

In [2]:
car_sales = pd.read_csv('car-sales.csv')
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

### Describing the Dataset

In [3]:
#Attribute
car_sales.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price            object
dtype: object

In [4]:
car_sales.columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [5]:
car_columns = car_sales.columns #Stores the columns as a list
car_columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [6]:
car_sales.index

RangeIndex(start=0, stop=10, step=1)

In [7]:
#Functions has Parentheses
car_sales.describe()  #Describe Works on only numeric columns

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

### Statistical representation of data

In [8]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [9]:
car_sales.mean()

Odometer (KM)    78601.4
Doors                4.0
dtype: float64

In [10]:
car_sales.sum()

Make             ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Colour               WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer (KM)                                               786014
Doors                                                           40
Price            $4,000.00$5,000.00$7,000.00$22,000.00$3,500.00...
dtype: object

In [11]:
#To select a single column use :dataset name[""] Also datasetname.columnname
car_sales["Doors"].sum()

40

In [12]:
car_sales.mode()

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White          11179    4.0  $7,000.00
1     NaN    NaN          31600    NaN        NaN
2     NaN    NaN          32549    NaN        NaN
3     NaN    NaN          45698    NaN        NaN
4     NaN    NaN          54738    NaN        NaN
5     NaN    NaN          60000    NaN        NaN
6     NaN    NaN          87899    NaN        NaN
7     NaN    NaN          99213    NaN        NaN
8     NaN    NaN         150043    NaN        NaN
9     NaN    NaN         213095    NaN        NaN

In [14]:
len(car_sales)

10

In [15]:
#Median
car_sales.median()

Odometer (KM)    57369.0
Doors                4.0
dtype: float64

In [18]:
#covariance
car_sales.cov()

               Odometer (KM)        Doors
Odometer (KM)   3.841951e+09 -2374.444444
Doors          -2.374444e+03     0.222222

In [19]:
#variance
car_sales.var()

Odometer (KM)    3.841951e+09
Doors            2.222222e-01
dtype: float64

In [21]:
#Skewness
car_sales.skew()

Odometer (KM)    1.308387
Doors            0.000000
dtype: float64

In [22]:
#Kurtosis
car_sales.kurtosis()

Odometer (KM)    1.354773
Doors            4.500000
dtype: float64